import WidgetSocialShare from './WidgetSocialShare';
import { useEffect, useState } from 'react';
const WidgetInstagram = () => {
  const [mounted, setMounted] = useState(false);
  useEffect(() => setMounted(true), []);
  useEffect(() => {
    const Script = document.createElement("script");
    //id should be same as given to form element
    const Form = document.getElementById("donateForm");
    Script.setAttribute(
      "src",
      "https://checkout.razorpay.com/v1/payment-button.js"
    );
    Script.setAttribute("data-payment_button_id", "pl_ID6cJSErE8MpO5");
    if (Form) {
      Form.appendChild(Script);
    }
  }, [mounted]);


  return (

    <>
      <div className="card">
        <div className="header">
          <div className="content">
            <span className="title">हस्तक्षेप को सपोर्ट करें</span>
            <p className="message">
              हस्तक्षेप आप जैसे सुधी पाठकों को सहयोग से संचालित होता है। हस्तक्षेप का
              रोज का डोज के साथ, हमारा उद्देश्य न केवल आपको दिन भर की सुर्खियों से
              अवगत कराना है, बल्कि ग्राउंड रिपोर्ट और डॉक्यूमेंट्री से लेकर विचार और
              विश्लेषण तक - हमारी कवरेज को क्यूरेट करना है। देश और दुनिया की खबरों के
              लिए हस्तक्षेप का डेली न्यूजलेटर पढ़ें। अगर आपको हमारा काम पसंद है, तो
              मेंबर बनकर हमें सपोर्ट करें.
            </p>
            {
              mounted ? <form id="donateForm"></form> : null
            }



          </div>
          <div className="social-media">
            <a href="https://www.facebook.com/hastakshephastakshep" target='_blank' rel="noreferrer" >
              <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 512 512">
                <path d="M504 256C504 119 393 8 256 8S8 119 8 256c0 123.78 90.69 226.38 209.25 245V327.69h-63V256h63v-54.64c0-62.15 37-96.48 93.67-96.48 27.14 0 55.52 4.84 55.52 4.84v61h-31.28c-30.8 0-40.41 19.12-40.41 38.73V256h68.78l-11 71.69h-57.78V501C413.31 482.38 504 379.78 504 256z" />
              </svg>
              <span className="tooltip-social">Facebook</span>
            </a>
            <a href="https://twitter.com/mediaamalendu" target="_blank" rel="noreferrer">
              <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 24 24" fill="currentColor">
                <path d="M23.954 4.569c-.885.389-1.832.654-2.83.775 1.016-.611 1.798-1.574 2.165-2.723-.952.565-2.005.975-3.126 1.197-.896-.957-2.175-1.555-3.588-1.555-2.721 0-4.921 2.201-4.921 4.921 0 .386.044.761.129 1.123-4.09-.205-7.721-2.152-10.157-5.132-.424.722-.666 1.56-.666 2.462 0 1.702.866 3.203 2.185 4.08-.805-.026-1.563-.247-2.222-.616v.061c0 2.385 1.693 4.374 3.945 4.828-.412.111-.847.171-1.292.171-.315 0-.622-.03-.925-.086.623 1.927 2.428 3.331 4.564 3.368-1.671 1.305-3.777 2.084-6.06 2.084-.393 0-.78-.023-1.166-.068 2.158 1.387 4.72 2.201 7.487 2.201 8.983 0 13.905-7.443 13.905-13.905 0-.212-.004-.425-.012-.635.955-.689 1.788-1.55 2.448-2.527z" />
              </svg>
              <span className="tooltip-social">Twitter</span>
            </a>
            <a href="https://www.youtube.com/@Hastakshepnews" target='_blank' rel="noreferrer">
              <svg
                xmlns="http://www.w3.org/2000/svg"
                fill="currentColor"
                className="bi bi-youtube"
                viewBox="0 0 16 16"
              >
                <path d="M8.051 1.999h.089c.822.003 4.987.033 6.11.335a2.01 2.01 0 0 1 1.415 1.42c.101.38.172.883.22 1.402l.01.104.022.26.008.104c.065.914.073 1.77.074 1.957v.075c-.001.194-.01 1.108-.082 2.06l-.008.105-.009.104c-.05.572-.124 1.14-.235 1.558a2.007 2.007 0 0 1-1.415 1.42c-1.16.312-5.569.334-6.18.335h-.142c-.309 0-1.587-.006-2.927-.052l-.17-.006-.087-.004-.171-.007-.171-.007c-1.11-.049-2.167-.128-2.654-.26a2.007 2.007 0 0 1-1.415-1.419c-.111-.417-.185-.986-.235-1.558L.09 9.82l-.008-.104A31.4 31.4 0 0 1 0 7.68v-.123c.002-.215.01-.958.064-1.778l.007-.103.003-.052.008-.104.022-.26.01-.104c.048-.519.119-1.023.22-1.402a2.007 2.007 0 0 1 1.415-1.42c.487-.13 1.544-.21 2.654-.26l.17-.007.172-.006.086-.003.171-.007A99.788 99.788 0 0 1 7.858 2h.193zM6.4 5.209v4.818l4.157-2.408L6.4 5.209z" />
              </svg>
              <span className="tooltip-social">YouTube</span>
            </a>
            <a href="https://whatsapp.com/channel/0029Va5m5VI7dmejYIIucP0t" target='_blank' rel="noreferrer">
              <svg className="socialSvg whatsappSvg" viewBox="0 0 16 16">
                <path d="M13.601 2.326A7.854 7.854 0 0 0 7.994 0C3.627 0 .068 3.558.064 7.926c0 1.399.366 2.76 1.057 3.965L0 16l4.204-1.102a7.933 7.933 0 0 0 3.79.965h.004c4.368 0 7.926-3.558 7.93-7.93A7.898 7.898 0 0 0 13.6 2.326zM7.994 14.521a6.573 6.573 0 0 1-3.356-.92l-.24-.144-2.494.654.666-2.433-.156-.251a6.56 6.56 0 0 1-1.007-3.505c0-3.626 2.957-6.584 6.591-6.584a6.56 6.56 0 0 1 4.66 1.931 6.557 6.557 0 0 1 1.928 4.66c-.004 3.639-2.961 6.592-6.592 6.592zm3.615-4.934c-.197-.099-1.17-.578-1.353-.646-.182-.065-.315-.099-.445.099-.133.197-.513.646-.627.775-.114.133-.232.148-.43.05-.197-.1-.836-.308-1.592-.985-.59-.525-.985-1.175-1.103-1.372-.114-.198-.011-.304.088-.403.087-.088.197-.232.296-.346.1-.114.133-.198.198-.33.065-.134.034-.248-.015-.347-.05-.099-.445-1.076-.612-1.47-.16-.389-.323-.335-.445-.34-.114-.007-.247-.007-.38-.007a.729.729 0 0 0-.529.247c-.182.198-.691.677-.691 1.654 0 .977.71 1.916.81 2.049.098.133 1.394 2.132 3.383 2.992.47.205.84.326 1.129.418.475.152.904.129 1.246.08.38-.058 1.171-.48 1.338-.943.164-.464.164-.86.114-.943-.049-.084-.182-.133-.38-.232z" />
              </svg>
              <span className="tooltip-social">Whatsapp</span>
            </a>
            <a href="https://in.pinterest.com/hastakshep" target="_blank" rel="noreferrer">
              <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 24 24" fill="currentColor">
                <path d="M12 2C6.486 2 2 6.486 2 12c0 4.949 3.653 9.061 8.426 9.828-.129-1.156-.246-2.93.051-4.203.266-1.093 1.712-6.972 1.712-6.972s-.437-.885-.437-2.188c0-2.046 1.187-3.576 2.662-3.576 1.253 0 1.86.942 1.86 2.072 0 1.262-.803 3.144-1.221 4.892-.348 1.566.738 2.846 2.27 2.846 2.724 0 4.823-3.288 4.823-7.99 0-3.463-2.48-5.885-6.019-5.885-4.088 0-6.547 3.072-6.547 6.254 0 1.171.448 2.441.995 3.127.111.134.129.254.1.394-.109.462-.356 1.462-.402 1.666-.062.281-.205.341-.497.203-1.909-.836-3.094-3.266-3.094-5.893 0-4.689 3.414-9.164 9.943-9.164 5.24 0 9.15 3.835 9.15 8.962 0 5.358-3.312 9.68-7.905 9.68-1.539 0-3.05-.811-3.55-1.77l-.964 3.619c-.322 1.211-1.197 2.719-1.785 3.633.678.208 1.384.321 2.112.321 5.514 0 10-4.486 10-10S17.514 2 12 2z" />
              </svg>
              <span className="tooltip-social">Pinterest</span>
            </a>
          </div>
        </div>
      </div >
    </>
  );
}

export default WidgetInstagram;